# 请不要修改这个文件
# 这个文件由 原序号字典下的几个py构建而成
# 自动生成时间：2025-05-19 00:24:54

from typing import Dict
创世_序号转模型: Dict[int, str]  = {
    488: "微型核弹组",
    491: "反物质湮灭单元",
    801: "量子储液罐",
    802: "矿物处理厂",
    803: "天穹装配厂",
    804: "物质裂解塔",
    805: "巨型化学反应釜",
    806: "精密结构组装厂",
    807: "人造恒星MK2",
    808: "大抽水机",
    809: "同位素温差发电机",
    810: "物质分解设施",
    811: "巨型粒子对撞机",
    812: "大气收集设施",
    813: "反物质导弹组",
    814: "量子储物仓",
    815: "聚爆加农炮MK2",
    816: "高频激光塔MK2",
    817: "核子爆破单元",
    818: "反物质炮弹",
}

创世_模型转序号: Dict[int, str]  = {
    "人造恒星MK2": 807,
    "反物质导弹组": 813,
    "反物质湮灭单元": 491,
    "反物质炮弹": 818,
    "同位素温差发电机": 809,
    "大抽水机": 808,
    "大气收集设施": 812,
    "天穹装配厂": 803,
    "巨型化学反应釜": 805,
    "巨型粒子对撞机": 811,
    "微型核弹组": 488,
    "核子爆破单元": 817,
    "物质分解设施": 810,
    "物质裂解塔": 804,
    "矿物处理厂": 802,
    "精密结构组装厂": 806,
    "聚爆加农炮MK2": 815,
    "量子储液罐": 801,
    "量子储物仓": 814,
    "高频激光塔MK2": 816,
}
