from typing import Dict
# 用法: from 蓝图格式.序号字典.模型与序号 import 序号转模型, 模型转序号

# 正向映射
序号转配方: Dict[int, str] = {
    0: '无配方',
    1: '铁块',
    2: '磁铁',
    3: '铜板',
    4: '石材',
    5: '齿轮',
    6: '磁线圈',
    9: '电磁矩阵',
    50: '电路板',
    57: '玻璃',
    63: '钢材',
    84: '传送带',
    85: '分拣器',
    112: '地基',
}


# 反向映射
配方转序号: Dict[str, int] = {
    '无配方': 0,
    '未定义': 0,
    '铁板': 1,#
    '铁块': 1,
    '磁铁': 2,
    '铜板': 3,
    '石材': 4,
    '齿轮': 5,
    '磁线圈': 6,
    '电磁矩阵': 9,
    '电路板': 50,
    '钢材': 53,
    '玻璃': 57,
    '传送带': 84,
    '分拣器': 85,
    '地基': 112,
}
