from 蓝图格式.图标 import 图标
from 蓝图格式.蓝图 import 蓝图头部, 缩略图, url字符串, 时间戳


def 解析头部(头部字符: str) -> 蓝图头部:
    分割头部: list[str] = 头部字符.split(',')
    if len(分割头部) != 15:
        raise ValueError(f'蓝图格式错误: 头部应被逗号分割成15个区域，当前为{len(分割头部)}个。头部字符：{头部字符}')
    if 分割头部[0] != '1':
        raise ValueError(f'蓝图格式错误: 头部第1个参数应为1。头部字符：{头部字符}')
    if 分割头部[7] != '0':
        raise ValueError(f'蓝图格式错误: 头部第8个参数应该为0。头部字符：{头部字符}')
    缩略 = 缩略图(
        图标布局=int(分割头部[1]),
        图标1=图标(int(分割头部[2])),
        图标2=图标(int(分割头部[3])),
        图标3=图标(int(分割头部[4])),
        图标4=图标(int(分割头部[5])),
        图标5=图标(int(分割头部[6])),
        小标题=url字符串.从url构造(分割头部[10])
    )
    return 蓝图头部(
        缩略图=缩略,
        创建时间=时间戳(int(分割头部[8])),
        游戏版本=分割头部[9],
        蓝图描述=url字符串.从url构造(分割头部[14]),
    )
