# 镜花水月: 指所有建筑都造不出来
from 蓝图格式.蓝图 import 蓝图
from 蓝图格式.蓝图 import url字符串
from 蓝图格式.图标 import 图标
from 功能.格式查找 import 蓝图内查找
from 功能.指鹿为马.通用 import 物品替换


class 改天换地字典:
    通用 = {
        "高速传送带" : "传送带",
        "极速传送带" : "传送带",
        "集装分拣器" : "分拣器",
        "电力感应塔" : "传送带",
        "储液罐" : "分拣器",
        "星际物流运输站": "行星内物流运输站",
        "大型采矿机": "行星内物流运输站",
        "位面熔炉" : "电弧熔炉",
        "制造台 Mk.II" : "制造台 Mk.I",
        "制造台 Mk.III": "制造台 Mk.I",
        "重组式制造台": "制造台 Mk.I",
        "采矿机": "分拣器",
        "抽水站": "分拣器",
        "分馏塔" : "分拣器",
    }

    原版 = {
        "负熵熔炉": "电弧熔炉",
        "量子化工厂": "化工厂",
    }

    创世 = {
        "量子化工厂": "化工厂",
    }

    创生 = {
        "负熵熔炉": "电弧熔炉",
    }

# 记得四向分流器
def 改天换地(输入数据: 蓝图) -> None:
    所有建筑 = 蓝图内查找(输入数据).所有建筑()
    for 当前建筑 in 所有建筑:
        # 如果蓝图包含分拣器, 则会出问题距离过短
        if 当前建筑.模型序号.是分拣器吗():
            物品替换(当前建筑).为(图标("水"))
    缩略图 = 蓝图内查找(输入数据).缩略图()
    缩略图.小标题 = url字符串("镜花水月")
    raise Exception("这函数还没写完呢")

