from enum import IntEnum

class 监测条件操作符(IntEnum):
    等于 = 0
    不等于 = 1
    大于等于 = 2
    大于 = 3
    小于等于 = 4
    小于 = 5

class 系统警报模式(IntEnum):
    无 = 0
    未满足条件 = 1
    满足条件 = 2
    有货物响 = 3
    无货物响 = 4
    未满足且有货物 = 5
    未满足且无货物 = 6

class 声音警报模式(IntEnum):
    无 = 0
    未满足条件 = 1
    满足条件 = 2
    有货物响 = 3
    无货物响 = 4
    未满足且有货物 = 5
    未满足且无货物 = 6

class 货物生成模式(IntEnum):
    不勾选 = 0
    生成货物 = 1
    消耗货物 = 2

class 声音警报音色(IntEnum):
    # 警报类（20-24）
    警报1 = 20
    警报2 = 21
    警报3 = 22
    警报4 = 23
    警报5 = 24

    # 钢琴类（1-2）
    钢琴1 = 1
    钢琴2 = 2

    # 贝斯类（3-4）
    贝斯1 = 3
    贝斯2 = 4

    # 风琴类（5-6）
    风琴1 = 5
    风琴2 = 6

    # 铺底类（7-9）
    铺底1 = 7
    铺底2 = 8
    铺底3 = 9

    # 独立音色（10-19）
    铜管乐 = 10
    梦铃 = 11
    玻璃 = 12
    吉他 = 13
    音乐盒 = 14
    电子琴 = 15
    小号 = 16
    小提琴 = 17
    低音贝斯 = 18
    鼓 = 19