

from copy import deepcopy
from 功能.格式查找 import 蓝图内查找
from 蓝图格式.坐标 import 姿态
from 蓝图格式.建筑 import 建筑

def _查找坐标(目标建筑:建筑)-> 姿态:
    if 目标建筑.空间姿态.姿态类型 == "分拣器姿态":
        坐标 = deepcopy(目标建筑.空间姿态.起点)
    else:
        坐标 = deepcopy(目标建筑.空间姿态)
    if 坐标.高度Z < -0.5:
        坐标.高度Z = -0.5
    return 坐标

def _决定偏移(目标接口: int)-> tuple[float, float, float]:
    if 目标接口 == 12:
        return 0.5, 0.0, 0.0
    elif 目标接口 == 13:
        return -0.5, 0.0, 0.0
    elif 目标接口 == 14:
        return 0.5, 0.0, 1.0
    elif 目标接口 == 15:
        return -0.5, 0.0, 1.0
    else:
        raise Exception(f"非法接口{目标接口}")

def _桥接分拣器缩阳入腹至(目标建筑:建筑 , 当前分拣器: 建筑, 所有建筑: list[建筑]):
    # 目标建筑一定是输入建筑
    目标建筑的坐标 = _查找坐标(目标建筑)
    偏移量 = _决定偏移(当前分拣器.输入接口.目标接口)
    当前分拣器.空间姿态.起点.东西X = 目标建筑的坐标.东西X + 偏移量[0]
    当前分拣器.空间姿态.起点.南北Y = 目标建筑的坐标.南北Y - 0.75
    当前分拣器.空间姿态.起点.高度Z = 目标建筑的坐标.高度Z + 偏移量[2]
    当前分拣器.空间姿态.起点.水平旋转Z = 0
    当前分拣器.空间姿态.起点.左右倾斜X = 0
    当前分拣器.空间姿态.起点.上下翻滚Y = 0

    当前分拣器.空间姿态.终点.东西X = 目标建筑的坐标.东西X + 偏移量[0]
    当前分拣器.空间姿态.终点.南北Y = 目标建筑的坐标.南北Y  + 0.75
    当前分拣器.空间姿态.终点.高度Z = 目标建筑的坐标.高度Z + 偏移量[2]
    当前分拣器.空间姿态.终点.水平旋转Z = 0
    当前分拣器.空间姿态.终点.左右倾斜X = 0
    当前分拣器.空间姿态.终点.上下翻滚Y = 0
def _带台分拣器缩阳入腹至(目标建筑:建筑 , 当前分拣器: 建筑, 所有建筑: list[建筑], 是带到台=True):
    目标建筑的坐标 = _查找坐标(目标建筑)
    if 是带到台:
        偏移量 = _决定偏移(当前分拣器.输出接口.目标接口)
    else:
        偏移量 = _决定偏移(当前分拣器.输入接口.目标接口)
    当前分拣器.空间姿态.起点.东西X = 目标建筑的坐标.东西X + 偏移量[0]
    当前分拣器.空间姿态.起点.南北Y = 目标建筑的坐标.南北Y - 0.5
    当前分拣器.空间姿态.起点.高度Z = 目标建筑的坐标.高度Z + 偏移量[2]
    当前分拣器.空间姿态.起点.水平旋转Z = 0
    当前分拣器.空间姿态.起点.左右倾斜X = 0
    当前分拣器.空间姿态.起点.上下翻滚Y = 0
    当前分拣器.空间姿态.终点.东西X = 目标建筑的坐标.东西X + 偏移量[0]
    当前分拣器.空间姿态.终点.南北Y = 目标建筑的坐标.南北Y + 0.5
    当前分拣器.空间姿态.终点.高度Z = 目标建筑的坐标.高度Z + 偏移量[2]
    当前分拣器.空间姿态.终点.水平旋转Z = 0
    当前分拣器.空间姿态.终点.左右倾斜X = 0
    当前分拣器.空间姿态.终点.上下翻滚Y = 0

def _单分拣器缩阳入腹(当前分拣器: 建筑, 所有建筑: list[建筑]):
    
    if 0 <= 当前分拣器.输入接口.目标接口 < 12:
        return
    if 0 <= 当前分拣器.输出接口.目标接口 < 12:
        return
    # TODO:临时
    if 当前分拣器.空间姿态.起点.高度Z > 8.74:
        return
    if      not 所有建筑[当前分拣器.输入接口.目标序号].模型序号.是传送带吗() \
        and not 所有建筑[当前分拣器.输出接口.目标序号].模型序号.是传送带吗():
        _桥接分拣器缩阳入腹至(所有建筑[当前分拣器.输入接口.目标序号], 当前分拣器, 所有建筑)
    elif    not 所有建筑[当前分拣器.输入接口.目标序号].模型序号.是传送带吗() \
        and     所有建筑[当前分拣器.输出接口.目标序号].模型序号.是传送带吗():
        _带台分拣器缩阳入腹至(所有建筑[当前分拣器.输入接口.目标序号], 当前分拣器, 所有建筑, 是带到台=False)
    elif        所有建筑[当前分拣器.输入接口.目标序号].模型序号.是传送带吗() \
        and not 所有建筑[当前分拣器.输出接口.目标序号].模型序号.是传送带吗():
        _带台分拣器缩阳入腹至(所有建筑[当前分拣器.输出接口.目标序号], 当前分拣器, 所有建筑, 是带到台=True)

def 单分拣器缩阳入腹(当前分拣器: 建筑, 所有建筑: list[建筑]):
    if not isinstance(当前分拣器, 建筑):
        raise NotImplementedError("输入必须是建筑")
    if not 当前分拣器.模型序号.是分拣器吗():
        raise NotImplementedError("输入建筑不是分拣器, 而是: " + 当前分拣器.模型序号.转名字())
    return _单分拣器缩阳入腹(当前分拣器, 所有建筑)

def 缩阳入腹(输入):
    所有建筑 = 蓝图内查找(输入).所有建筑()
    for 本建筑 in 所有建筑:
        if 本建筑.模型序号.是分拣器吗():
            _单分拣器缩阳入腹(本建筑, 所有建筑)
