from 蓝图格式.区域 import 区域
from 蓝图格式.蓝图 import 蓝图
from 蓝图格式.坐标 import 传送带姿态, 分拣器姿态
from 蓝图格式.坐标 import 普通建筑姿态
from 功能.格式查找 import 蓝图内查找

def 舍弃精度(输入, 精度容忍=128):
    return round(输入 * 精度容忍) / 精度容忍
def _单层姿态舍弃精度(当前姿态, 精度容忍):
    当前姿态.东西X = 舍弃精度(当前姿态.东西X, 精度容忍)
    当前姿态.南北Y = 舍弃精度(当前姿态.南北Y, 精度容忍)
    当前姿态.高度Z = 舍弃精度(当前姿态.高度Z, 精度容忍)

def _单层全姿态舍弃旋转(当前姿态, 精度容忍):
    当前姿态.左右倾斜X = 舍弃精度(当前姿态.左右倾斜X, 精度容忍)
    当前姿态.上下翻滚Y = 舍弃精度(当前姿态.上下翻滚Y, 精度容忍)
    当前姿态.水平旋转Z = 舍弃精度(当前姿态.水平旋转Z, 精度容忍)

class 批量舍弃精度:
    def __init__(self, 输入数据):
        self.所有建筑 = 蓝图内查找(输入数据).所有建筑()

    def 坐标(self, 精度容忍=128):
        for 单个建筑 in self.所有建筑:
            当前姿态 = 单个建筑.空间姿态
            if isinstance(当前姿态, 普通建筑姿态) or isinstance(当前姿态, 传送带姿态):
                _单层姿态舍弃精度(当前姿态, 精度容忍)
            elif isinstance(当前姿态, 分拣器姿态):
                _单层姿态舍弃精度(当前姿态.起点, 精度容忍)
                _单层姿态舍弃精度(当前姿态.终点, 精度容忍)
        return self

    def 旋转(self, 精度容忍=1):
        for 单个建筑 in self.所有建筑:
            当前姿态 = 单个建筑.空间姿态
            if isinstance(当前姿态, 普通建筑姿态):
                当前姿态.水平旋转Z = 舍弃精度(当前姿态.水平旋转Z, 精度容忍)
            elif isinstance(当前姿态, 传送带姿态):
                当前姿态.水平旋转Z = 舍弃精度(当前姿态.水平旋转Z, 精度容忍)
                当前姿态.左右倾斜X = 舍弃精度(当前姿态.左右倾斜X, 精度容忍)
            elif isinstance(当前姿态, 分拣器姿态):
                _单层全姿态舍弃旋转(当前姿态.起点, 精度容忍)
                _单层全姿态舍弃旋转(当前姿态.终点, 精度容忍)
            else:
                raise Exception("致命错误: 未知姿态")
        return self


